04_Simulation/1.FROZEN/SST_MediumBody_with.inlet.dat.profile.interpolated_GEP_Tr.aijx.RijHat.squCyl.region_Ha5.newfrozenAppr.f.cube_aijx_term_ON_Rterm_corr_OFF/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;



}

//simulationType  RASModel;


// ************************************************************************* //
